package kr.co.softbridge.voplatform.room.mapper;

import java.util.ArrayList;
import java.util.Collection;
import java.util.HashMap;
import java.util.List;

import kr.co.softbridge.voplatform.commons.annotation.PrimaryMapper;
import kr.co.softbridge.voplatform.room.dto.GetRoomNoDto;
import kr.co.softbridge.voplatform.room.dto.RoomDetlDto;
import kr.co.softbridge.voplatform.room.dto.RoomDto;
import kr.co.softbridge.voplatform.room.dto.RoomHistDto;
import kr.co.softbridge.voplatform.room.dto.RoomViewDto;
import kr.co.softbridge.voplatform.room.dto.UserListDto;

@PrimaryMapper
public interface RoomMapper {
	/*************************************************************************************************************
	* @brief  : room 개수 확인 mapper
	* @method : getRoomTotalCount
	* @author : 이민재
	**************************************************************************************************************/
	int getRoomTotalCount(HashMap<String, Object> paramMap);
	
	/*************************************************************************************************************
	* @brief  : room 정보 등록
	* @method : insertRoom
	* @author : 이민재
	**************************************************************************************************************/
	int insertRoom(HashMap<String, Object> roomInsMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 정보(참여자) 등록
	* @method : insJoinPeople
	* @author : 이민재
	**************************************************************************************************************/
	int insJoinPeople(HashMap<String, Object> roomInsMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 이력번호 조회
	* @method : getHistorySeq
	* @author : 이민재
	**************************************************************************************************************/
	int getHistorySeq();
	
	/*************************************************************************************************************
	* @brief  : 회의 이력 정보 등록
	* @method : insRoomHist
	* @author : 이민재
	**************************************************************************************************************/
	int insRoomHist(HashMap<String, Object> roomInsMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 목록 조회
	* @method : getRoomList
	* @author : 이민재
	**************************************************************************************************************/
	RoomDto getRoomList(HashMap<String, Object> paramMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 상세 조회
	* @method : RoomView
	* @author : 이민재
	**************************************************************************************************************/
	RoomDetlDto RoomViewDetl(HashMap<String, Object> paramMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 참여자 조회
	* @method : RoomView
	* @author : 이민재
	**************************************************************************************************************/
	List<UserListDto> RoomJoinUserList(HashMap<String, Object> paramMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 방 비밀번호 조회
	* @method : RoomPwSel
	* @author : 이민재
	**************************************************************************************************************/
	String RoomPwSel(HashMap<String, Object> paramMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 방 수정
	* @method : tbRoomUpt
	* @author : 이민재
	**************************************************************************************************************/
	int tbRoomUpt(HashMap<String, Object> roomUptMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 기존 참가자들 삭제
	* @method : tbRoomUserDel
	* @author : 이민재
	**************************************************************************************************************/
	void tbRoomUserDel(HashMap<String, Object> roomUptMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 목록조회 시 유저리스트 조회
	* @method : getUserList
	* @author : 이민재
	**************************************************************************************************************/
	List<UserListDto> getUserList(HashMap<String, Object> paramMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 목록 방번호 조회
	* @method : getRoomNo
	* @author : 이민재
	**************************************************************************************************************/
	List<GetRoomNoDto> RoomNoSel(HashMap<String, Object> paramMap);

	/*************************************************************************************************************
	* @brief  : 회의 방 삭제
	* @method : roomDelete
	* @author : 이민재
	**************************************************************************************************************/
	void roomDelete(HashMap<String, Object> paramMap);

	/*************************************************************************************************************
	* @brief  : 회의 이력 정보 등록 (삭제)
	* @method : delRoomHistIns
	* @author : 이민재
	**************************************************************************************************************/
	int delRoomHistIns(HashMap<String, Object> paramMap);

	/*************************************************************************************************************
	* @brief  : 회의 이력 정보 조회 (삭제)
	* @method : selTbRoomHist
	* @author : 이민재
	**************************************************************************************************************/
	RoomHistDto selTbRoomHist(HashMap<String, Object> paramMap);
	
	/*************************************************************************************************************
	* @brief  : 회의 있는지 체크
	* @method : roomSel
	* @author : 이민재
	**************************************************************************************************************/
	int roomSel(HashMap<String, Object> paramMap);
	
	
}
